RhinoInside.Revit API Documentation
GeometryEncoder Methods
The GeometryEncoder type exposes the following members.
Methods
Name | Description
ToArc(Arc)
 Converts the specified Rhino.Geometry.Arc to an equivalent of Autodesk.Revit.DB.Arc.
ToArc(Circle)
 Converts the specified Rhino.Geometry.Circle to an equivalent of Autodesk.Revit.DB.Arc.
ToBoundingBoxXYZ(BoundingBox)
 Converts the specified Rhino.Geometry.BoundingBox to an equivalent Autodesk.Revit.DB.BoundingBoxXYZ.
ToBoundingBoxXYZ(Box)
 Converts the specified Rhino.Geometry.Box to an equivalent Autodesk.Revit.DB.BoundingBoxXYZ.
ToCurve(ArcCurve)
 Converts the specified Rhino.Geometry.ArcCurve to an equivalent of Autodesk.Revit.DB.Curve.
ToCurve(Curve)
 Converts the specified Rhino.Geometry.Curve to an equivalent of Autodesk.Revit.DB.Curve.
ToCurve(Ellipse)
 Converts the specified Rhino.Geometry.Ellipse to an equivalent of Autodesk.Revit.DB.Curve.
ToCurve(LineCurve)
 Converts the specified Rhino.Geometry.LineCurve to an equivalent of Autodesk.Revit.DB.Curve.
ToCurve(NurbsCurve)
 Converts the specified Rhino.Geometry.NurbsCurve to an equivalent of Autodesk.Revit.DB.Curve.
ToCurve(PolyCurve)
 Converts the specified Rhino.Geometry.PolyCurve to an equivalent of Autodesk.Revit.DB.Curve.
ToCurve(PolylineCurve)
 Converts the specified Rhino.Geometry.PolylineCurve to an equivalent of Autodesk.Revit.DB.Curve.
ToCurve(Ellipse, Interval)
 Converts the specified Rhino.Geometry.Ellipse within the given Rhino.Geometry.Intervalto an equivalent of Autodesk.Revit.DB.Curve.
ToCurveArray
 Converts the specified Rhino.Geometry.Curve to an equivalent of Autodesk.Revit.DB.CurveArray.
ToCurveLoop
 Converts the specified Rhino.Geometry.Curve to an equivalent of Autodesk.Revit.DB.CurveLoop containing consecutive segments of the input curve.
ToGeometryObject
 Converts the specified Rhino.Geometry.GeometryBase to an equivalent of Autodesk.Revit.DB.GeometryObject.
ToLine
 Converts the specified Rhino.Geometry.Line to an equivalent Autodesk.Revit.DB.Line.
ToLines
 Converts the specified Rhino.Geometry.Polyline to an equivalent array of Autodesk.Revit.DB.Line.
ToMesh(Brep)
 Converts the specified Rhino.Geometry.Brep to an equivalent of Autodesk.Revit.DB.Mesh.
ToMesh(Extrusion)
 Converts the specified Rhino.Geometry.Extrusion to an equivalent of Autodesk.Revit.DB.Mesh.
ToMesh(Mesh)
 Converts the specified Rhino.Geometry.Mesh to an equivalent of Autodesk.Revit.DB.Mesh.
ToMesh(SubD)
 Converts the specified Rhino.Geometry.SubD to an equivalent of Autodesk.Revit.DB.Mesh.
ToOutline
 Converts the specified Rhino.Geometry.BoundingBox to an equivalent Autodesk.Revit.DB.Outline.
ToPlane
 Converts the specified Rhino.Geometry.Plane to an equivalent Autodesk.Revit.DB.Plane.
ToPoint
 Converts the specified Rhino.Geometry.Point to an equivalent of Autodesk.Revit.DB.Point.
ToPoints
 Converts the specified Rhino.Geometry.PointCloud to an equivalent array of Autodesk.Revit.DB.Point.
ToPolyLine
 Converts the specified Rhino.Geometry.Polyline to an equivalent of Autodesk.Revit.DB.PolyLine.
ToSolid(Brep)
 Converts the specified Rhino.Geometry.Brep to an equivalent of Autodesk.Revit.DB.Solid.
ToSolid(Extrusion)
 Converts the specified Rhino.Geometry.Extrusion to an equivalent of Autodesk.Revit.DB.Solid.
ToSolid(Mesh)
 Converts the specified Rhino.Geometry.Mesh to an equivalent of Autodesk.Revit.DB.Solid.
ToSolid(SubD)
 Converts the specified Rhino.Geometry.SubD to an equivalent of Autodesk.Revit.DB.Solid.
ToTransform
 Converts the specified Rhino.Geometry.Transform to an equivalent Autodesk.Revit.DB.Transform.
ToUV(Point2d)
 Converts the specified Rhino.Geometry.Point2d to an equivalent Autodesk.Revit.DB.UV.
ToUV(Point2f)
 Converts the specified Rhino.Geometry.Point2f to an equivalent Autodesk.Revit.DB.UV.
ToUV(Vector2d)
 Converts the specified Rhino.Geometry.Vector2d to an equivalent Autodesk.Revit.DB.UV.
ToUV(Vector2f)
 Converts the specified Rhino.Geometry.Vector2f to an equivalent Autodesk.Revit.DB.UV.
ToXYZ(Point3d)
 Converts the specified Rhino.Geometry.Point3d to an equivalent Autodesk.Revit.DB.XYZ.
ToXYZ(Point3f)
 Converts the specified Rhino.Geometry.Point3f to an equivalent Autodesk.Revit.DB.XYZ.
ToXYZ(Vector3d)
 Converts the specified Rhino.Geometry.Vector3d to an equivalent Autodesk.Revit.DB.XYZ.
ToXYZ(Vector3f)
 Converts the specified Rhino.Geometry.Vector3f to an equivalent Autodesk.Revit.DB.XYZ.
Top
See Also
Reference
GeometryEncoder Class
RhinoInside.Revit.Convert.Geometry Namespace